<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c3{-webkit-text-decoration-skip:none;color:#d0d0d0;font-weight:400;text-decoration:underline;vertical-align:baseline;text-decoration-skip-ink:none;font-size:8pt;font-family:"Arial";font-style:normal}.c1{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c4{text-decoration-skip-ink:none;font-size:8pt;-webkit-text-decoration-skip:none;color:#d0d0d0;text-decoration:underline}.c0{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-align:left}.c2{background-color:#ffffff;max-width:468pt;padding:72pt 72pt 72pt 72pt}.c5{color:inherit;text-decoration:inherit}.title{padding-top:24pt;color:#000000;font-weight:700;font-size:36pt;padding-bottom:6pt;font-family:"Arial";line-height:1.0;page-break-after:avoid;text-align:left}.subtitle{padding-top:18pt;color:#666666;font-size:24pt;padding-bottom:4pt;font-family:"Georgia";line-height:1.0;page-break-after:avoid;font-style:italic;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:12pt;color:#000000;font-weight:700;font-size:24pt;padding-bottom:12pt;font-family:"Arial";line-height:1.0;text-align:left}h2{padding-top:11.2pt;color:#000000;font-weight:700;font-size:18pt;padding-bottom:11.2pt;font-family:"Arial";line-height:1.0;text-align:left}h3{padding-top:12pt;color:#000000;font-weight:700;font-size:14pt;padding-bottom:12pt;font-family:"Arial";line-height:1.0;text-align:left}h4{padding-top:12.8pt;color:#000000;font-weight:700;font-size:12pt;padding-bottom:12.8pt;font-family:"Arial";line-height:1.0;text-align:left}h5{padding-top:12.8pt;color:#000000;font-weight:700;font-size:9pt;padding-bottom:12.8pt;font-family:"Arial";line-height:1.0;text-align:left}h6{padding-top:18pt;color:#000000;font-weight:700;font-size:8pt;padding-bottom:18pt;font-family:"Arial";line-height:1.0;text-align:left}</style></head><body class="c2 doc-content"><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; 3. Propuesta t&eacute;cnica</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.1. Introducci&oacute;n de la propuesta t&eacute;cnica</span></p><p class="c0"><span class="c1">Desde el grupo Osborne se plantea realizar un proyecto de migraci&oacute;n de la web de su marca 5J (https://www.cincojotas.es/) desarrollada bajo tecnolog&iacute;a Magento a la tecnolog&iacute;a SAP Commerce.</span></p><p class="c0"><span class="c1">Se trata de un proyecto ambicioso, que tiene por objetivo no solo migrar a otra tecnolog&iacute;a totalmente diferente donde ya se cuenta con un ecommerce en producci&oacute;n, sino que, adem&aacute;s, se quiere realizar una migraci&oacute;n gr&aacute;fica realizando un redise&ntilde;o completo de su web, incorporando nuevos componentes y animaciones que presentan una web mucho m&aacute;s atractiva con aspecto din&aacute;mico y moderno.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.2. Contexto del proyecto</span></p><p class="c0"><span class="c1">Osborne es un grupo empresarial de origen espa&ntilde;ol del sector retail, con 250 a&ntilde;os de experiencia, reconocida internacionalmente por la elaboraci&oacute;n artesanal de productos gourmet, marcas de bebidas y alimentaci&oacute;n premium con presencia en m&aacute;s de 50 pa&iacute;ses.</span></p><p class="c0"><span class="c1">A nivel tecnol&oacute;gico se han identificado tres sitios relevantes relacionados con el objetivo de esta propuesta:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Matriz del grupo, web de Osborne -&gt;&nbsp; https://www.osborne.es</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Marca Caviar Riofrio -&gt; https://www.caviarderiofrio.com</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Marca 5J -&gt; https://www.cincojotas.es</span></p><p class="c0"><span class="c1">Tanto la web de Osborne como la de Caviar Riofrio se encuentran construidas sobre la plataforma SAP Commerce, con un frontal desacoplado sobre el framework Composable Storefront. En el caso de 5J el sitio est&aacute; construido sobre Magento actualmente. El objetivo de este proyecto es doble, migrar tecnol&oacute;gicamente el proyecto de 5J a la plataforma SAP Commerce y aprovechar esta nueva soluci&oacute;n para plantear un redise&ntilde;o total de la misma, tratando de tener una experiencia de usuario mucho m&aacute;s atractiva, siguiendo con el look&amp;feel que transmita la calidad del producto que permita conseguir el objetivo actual y atraer nuevos clientes.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.3. Nuestra soluci&oacute;n para el proyecto&nbsp;</span></p><p class="c0"><span class="c1">Nuestra experiencia de m&aacute;s de 10 a&ntilde;os en proyectos de creaci&oacute;n y migraci&oacute;n de plataformas ecommerce y conocimiento sobre la tecnolog&iacute;a tanto de Magento como SAP Commerce, nos permitir&aacute; tener una visi&oacute;n cr&iacute;tica de cada fase del proyecto de migraci&oacute;n. Arrancando nuestra visi&oacute;n del proyecto desde un conocimiento total, tanto del entorno actual como de los requerimientos del proyecto, desde el punto de vista tecnol&oacute;gico y de negocio. Para ello, perseguiremos los objetivos del proyecto focaliz&aacute;ndonos en el nuevo redise&ntilde;o, con el fin de conseguir velar por construir una soluci&oacute;n s&oacute;lida y de nivel que Osborne espera.</span></p><p class="c0"><span class="c1">Dentro del equipo de trabajo que se presentar&aacute; a continuaci&oacute;n, Hiberus pone a disposici&oacute;n de Grupo Osborne un equipo con larga experiencia que permitir&aacute;n tener una visi&oacute;n sobre cada uno de los aspectos que surjan y sean claves para asegurar el &eacute;xito del proyecto. Este equipo contara con un alto conocimiento de SAP Commerce y ademas contara en todo momento con el apoyo de equipos especializados en Magento y Estrategia Digital, como posicionamiento SEO, experiencia de usuario, anal&iacute;tica, y otras muchas disciplinas que se consideren o sean necesarias, operando un proyecto 360&ordm;.</span></p><p class="c0"><span class="c1">Como punto de partida para la soluci&oacute;n tecnol&oacute;gica, se ha analizado detalladamente toda la informaci&oacute;n trasladada por Grupo Osborne sobre los nuevos requerimientos, adem&aacute;s, se ha realizado un an&aacute;lisis de los sites actuales de Osborne, Caviar Riofrio y 5Js. En el caso de las dos primeras, se encuentran ya sobre la plataforma SAP Commerce, y en este caso nuestro an&aacute;lisis esta focalizado en alinear las necesidades trasladadas para el proyecto de 5Js con las funcionalidades del site de Osborne.</span></p><p class="c0"><span class="c1">Respecto del planteamiento del proyecto, desde Osborne se plantea la posibilidad de realizar el proyecto de una forma faseada, donde en una primera fase se promocione la soluci&oacute;n al entorno productivo bajo la tecnolog&iacute;a de SAP Commerce con las funcionalidades m&aacute;s relevantes en el mes de marzo 2024, dejando para una segunda fase el resto de las funcionalidades que completan la web. En el desarrollo de esta propuesta se indicar&aacute;n aquellos requisitos que forman parte de cada una de las fases planteadas, Hiberus como soluci&oacute;n del proyecto, ha analizado para incluir aproximadamente un 90% de los requisitos como must del proyecto, incluy&eacute;ndolo en la primera fase del MVP.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">La fase MVP contar&aacute; con el 90% del proyecto realizado, por lo que pr&aacute;cticamente ser&aacute; la totalidad de los desarrollos como explicamos en el punto 4.1 Roadmap de proyecto.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Despu&eacute;s de analizar los requerimientos trasladados y el proyecto actual, el mayor esfuerzo del proyecto se centrar&aacute; en la elaboraci&oacute;n de componentes sobre la plataforma, que permita al equipo de Osborne la generaci&oacute;n de p&aacute;ginas y landings del ecommerce con dise&ntilde;os atractivos, de forma din&aacute;mica, &aacute;gil y aut&oacute;noma. Hiberus ha realizado un an&aacute;lisis detallado de los diferentes dise&ntilde;os presentados por Osborne para identificar el conjunto de componentes a abordar, y tratar as&iacute; de minimizar el n&uacute;mero total de desarrollos y por tanto tiempo futuro, tratando de encontrar patrones comunes que reduzcan el esfuerzo.</span></p><p class="c0"><span class="c1">Como gran aportaci&oacute;n al proyecto en cuanto a agilidad, escalabilidad y uso intuitivo y sencillo, el reto desde Hiberus ser&aacute; el de crear un Sistema de Dise&ntilde;o Componentes SAP Commerce, pudiendo facilitar a Grupo Osborne la gesti&oacute;n y creaci&oacute;n de nuevas p&aacute;ginas futuras, reutilizando componentes existentes a trav&eacute;s de configuraciones. Este enfoque, permitir&aacute; que un mismo componente resuelva varios casos de uso, personalizando el estilo y dise&ntilde;o de cada uno de los portales y minimizando el mantenimiento y gesti&oacute;n de los componentes a futuro. Se ampl&iacute;a informaci&oacute;n sobre c&oacute;mo afectar&iacute;a esto a la migraci&oacute;n visual del resto de site&acute;s (Osborne y Caviar de Riofrio) en el apartado 4.1 Roadmao del proyecto.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Como aportaci&oacute;n de valor al proyecto, proponemos crear un Sistema de Dise&ntilde;o de Componentes de SAP Commerce que mejore el ecosistema global del ecommerce de Osborne.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Otro de los objetivos importantes del proyecto ser&aacute; el de conseguir que el performance y los tiempos de carga de las p&aacute;ginas sea &oacute;ptimos, pudiendo as&iacute; satisfacer best practice desde el punto de vista de la tecnolog&iacute;a, la experiencia de usuario y el posicionamiento, es por ello que se plantear&aacute;n en el documento diferentes estrategias para conseguir garantizar el rendimiento de la soluci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">En resumen, nuestra soluci&oacute;n para el proyecto pasa por desarrollar un sistema de componentes reutilizables, que permita la creaci&oacute;n del proyecto 5Js, pero, adem&aacute;s, que facilite la migraci&oacute;n visual de Osborne y Caviar Riofrio en un futuro, haciendo dicha migraci&oacute;n mucho m&aacute;s sencilla y &aacute;gil. Nuestro objetivo es ayudar a Osborne a mejorar su ecosistema a trav&eacute;s de una metodolog&iacute;a basada en componentes reutilizables.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.4. Requisitos funcionales</span></p><p class="c0"><span class="c1">En t&eacute;rminos de requisitos funcionales, el enfoque del proyecto se centra en el aspecto gr&aacute;fico, con algunas excepciones puntuales en el backend. El desarrollo actual para el sitio web de Osborne act&uacute;a como punto de referencia de reutilizaci&oacute;n para nivel de cualquier integraci&oacute;n backend con terceros o con la propia base de productos del grupo Osborne.</span></p><p class="c0"><span class="c1">Es por ello por lo que en este apartado fundamentalmente nos focalizaremos en detallar el sistema de componentes que proponemos para dar cabida al redise&ntilde;o web planteado.&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.4.1. Sistema de Dise&ntilde;o de componentes de SAP Commerce para Grupo Osborne</span></p><p class="c0"><span class="c1">El principal esfuerzo identificado en el proyecto se deriva de la creaci&oacute;n de componentes visuales que permitan a Osborne crear las p&aacute;ginas del sitio web para 5J. Sin embargo, el objetivo del desarrollo de estos componentes es que estos componentes tengan un grado de abstracci&oacute;n suficiente para poder ser utilizados en un futuro para el resto de websites del grupo, entendemos que inicialmente por Osborne y Caviar Riofrio.</span></p><p class="c0"><span class="c1">&iquest;Qu&eacute; ventajas ofrece la creaci&oacute;n del sistema de dise&ntilde;o de componentes de SAP Commerce?</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Reutilizaci&oacute;n Eficiente: Al utilizar componentes gr&aacute;ficos, aprovechamos dise&ntilde;os y funcionalidades previamente desarrollados, lo que significa menos trabajo repetitivo y ahorro de tiempos.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Optimizaci&oacute;n de la Arquitectura: Un sistema de componentes bien dise&ntilde;ado proporciona una arquitectura gr&aacute;fica s&oacute;lida y escalable, lo que facilita futuras actualizaciones y mejoras.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Incrementos R&aacute;pidos: La construcci&oacute;n de nuevas p&aacute;ginas o caracter&iacute;sticas se acelera considerablemente al aprovechar componentes existentes.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Consistencia Visual: Los componentes garantizan una coherencia visual en todo el sitio web, lo que mejora la experiencia del usuario.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Mantenimiento Simplificado: Con un sistema de componentes, las actualizaciones y correcciones se aplican de manera m&aacute;s uniforme en todo el sitio, lo que reduce el riesgo de errores.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Facilita la Colaboraci&oacute;n: Un sistema de componentes facilita la colaboraci&oacute;n entre dise&ntilde;adores y desarrolladores, ya que ambos trabajan con un conjunto definido de elementos y reglas, lo que reduce malentendidos y agiliza el proceso de desarrollo.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Ahorro de costes: Al reducir la duplicaci&oacute;n de esfuerzos y acelerar el desarrollo, un sistema de componentes puede generar ahorros significativos en t&eacute;rminos de tiempo y costos.</span></p><p class="c0"><span class="c1">A continuaci&oacute;n, se detallan los componentes identificados en cada una de las p&aacute;ginas existentes en los diferentes dise&ntilde;os:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; A. COMPONENTES COMUNES</span></p><p class="c0"><span class="c1">Tras una revisi&oacute;n global de todos los dise&ntilde;os se han detectado una serie de componentes reutilizables en diversas p&aacute;ginas de la web que englobamos en el ep&iacute;grafe Componentes Comunes. Su detecci&oacute;n permite optimizar la arquitectura de componentes de la web as&iacute; como fomentar la reutilizaci&oacute;n en los desarrollos.</span></p><p class="c0"><span class="c1">Esos componentes reutilizables son los siguientes:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; HEADER</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; MEN&Uacute; EMERGENTE / MEN&Uacute; PANTALLA COMPLETA</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CARD DE PRODUCTO TIPO 1</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CARD DE PRODUCTO TIPO 2</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE MULTIMEDIA CONFIGURABLE</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE FILTROS DE CATEGOR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER GARANT&Iacute;A OFICIAL</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER INSTAGRAM</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER STORIES PRIMARIO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CARD STORY</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER TEXTO GEN&Eacute;RICO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SUSCRIPCI&Oacute;N A NEWSLETTER</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER PREGUNTAS FRECUENTES</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; FOOTER</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">La siguiente tabla desglosa por cada uno de ellos su grado de utilizaci&oacute;n en las diferentes p&aacute;ginas de la web y m&aacute;s adelante detallaremos cada uno de ellos:</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">HEADER</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Acceso a men&uacute;, logo, tienda, mi cuenta, cesta</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">MEN&Uacute; EMERGENTE / MEN&Uacute; PANTALLA COMPLETA</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Capas desplegables que muestran subcategor&iacute;as con imagen gr&aacute;fica asociada. Deben diferenciarse los links principales con los menos importantes que se muestran en la parte inferior</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CARD DE PRODUCTO TIPO 1</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Elemento que se alimenta con el SKU del producto y que permite visibilizar juego de fotos, nombre, descripci&oacute;n corta y potencialmente precios u otros atributos.</span></p><p class="c0"><span class="c1">Se regular&aacute; con un enumerado la elecci&oacute;n entre los diferentes tipos de maquetaciones.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CARD DE PRODUCTO TIPO 2</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Elemento que se alimenta con el SKU del producto y que permite visibilizar juego de fotos, nombre, descripci&oacute;n corta y potencialmente precios u otros atributos.</span></p><p class="c0"><span class="c1">Se regular&aacute; con un enumerado la elecci&oacute;n entre los diferentes tipos de maquetaciones. Se utiliza por ejemplo en el banner de la homepage.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE MULTIMEDIA CONFIGURABLE</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se trata de un elemento frecuentemente referenciado en el dise&ntilde;o, que consta de</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Un recurso multimedia (v&iacute;deo o una imagen).</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Titulo primario</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Breve descripci&oacute;n conceptual (opcional)</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Link a URL destino (opcional)</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE FILTROS DE CATEGOR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Seg&uacute;n la entidad afectada se precargan las categor&iacute;as respetando mismo comportamiento gr&aacute;fico.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER GARANT&Iacute;A OFICIAL</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Cuadro gr&aacute;fico que encapsula iconograf&iacute;a relacionada con la garant&iacute;a.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER INSTAGRAM</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Usos en Homepage y p&aacute;gina de pedido realizado. Link a cuenta corporativa de Instagram, carrusel de elementos multimedia &ndash;no alojados en Instagram-</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER STORIES PRIMARIO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Usos en PLP, PDP y Homepage. Doble columna, foto comercial, texto conceptual, autor&iacute;a, color fondo y enlace</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CARD STORY</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Tarjeta reutilizable, modular y contribuible por CMS.</span></p><p class="c0"><span class="c1">Consta de una imagen, titulo y enlace.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER TEXTO GEN&Eacute;RICO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Usos en PLP y PDP. Componente gr&aacute;fico b&aacute;sico que consta de t&iacute;tulo y descripci&oacute;n. Ambos ser&aacute;n textos enriquecidos para poder a&ntilde;adir colores, negritas, etc.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SUSCRIPCI&Oacute;N A NEWSLETTER</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Componente para suscripciones a newsletter. Usos en PLP, PDP, Homepage, Experiencias, etc.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER PREGUNTAS FRECUENTES</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Tiene un modo de visualizaci&oacute;n en modo colapsable y otro en modo no colapsado (con opciones desplegadas, en cuyo caso se visibiliza el texto que responde a la pregunta formulada).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">FOOTER</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Presente en todas las p&aacute;ginas de la web. Implicar&aacute; su segmentaci&oacute;n en diferentes slots seg&uacute;n el contenido a albergar.</span></p><p class="c0"><span class="c1">A. HOMEPAGE</span></p><p class="c0"><span class="c1">Se identifican tres componentes espec&iacute;ficos de esta p&aacute;gina:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER CON ANIMACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER DE PRODUCTOS</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER DE PRODUCTO PERSONALIZADO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER CON ANIMACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Componente con imagen/video y un enlace que deben ser contribuidos.</span></p><p class="c0"><span class="c1">Campos a contribuir: Foto o video /Enlace</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se propone utilizar la libreria swiper. Sus opciones permiten configurar diferentes comportamientos y m&eacute;todos de visualizaci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER DE PRODUCTO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: El slider se alimenta de cards de productos (en adelante referido como Card de producto Tipo 1, detallada dentro del ep&iacute;grafe elementos comunes). La librer&iacute;a swiper permite crear un carrusel con el comportamiento deseado.</span></p><p class="c0"><span class="c1">Campos a contribuir: Lista de componentes Card de producto Tipo 1</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Crear un componente que internamente defina una tarjeta de producto que nos permita ser utilizados en otros componentes como es este caso. La librer&iacute;a swiper permite crear un carrusel con el comportamiento deseado.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER DE PRODUCTO PERSONALIZADO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: El Banner se alimenta de los datos de un producto, de una imagen y de un t&iacute;tulo.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Componente Card de producto tipo 2</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Crear un componente que internamente defina una segunda ficha de producto que nos permita utilizarlo en otros componentes. La imagen y el t&iacute;tulo adicionales deber&aacute;n contribuirse en el CMS.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; B. PLP</span></p><p class="c0"><span class="c1">La p&aacute;gina de listado de productos es una variaci&oacute;n importante sobre el est&aacute;ndar OOTB de SAP Commmerce ya que no se requiere una p&aacute;gina normal de listado de productos devuelto por el buscador Solr sino que se plantea que las p&aacute;ginas de categor&iacute;a sean p&aacute;ginas de contenido que se nutren con los diferentes componentes que se decidan incorporar a cada p&aacute;gina de categor&iacute;a. Es importante destacar que bajo este planteamiento si se a&ntilde;ade un producto al cat&aacute;logo de una determinada categor&iacute;a, no aparecer&aacute; de forma autom&aacute;tica, sino que deber&aacute; ser incorporado a uno de los componentes de la p&aacute;gina de la categor&iacute;a.</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de esta p&aacute;gina:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CABECERA PLP</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; ICONOS DESCRIPTIVOS CABECERA PLP</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; ENLACE A OTRAS CATEGOR&Iacute;AS CABECERA PLP</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER GR&Aacute;FICO DE CATEGOR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CARD PRODUCTO DE DOS COLUMNAS</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CARD PRODUCTO SIMPLE</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER ENTREGA Y DELIVERY</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER RECTANGULAR &ldquo;TIEMPO OBRA MAESTRA&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER VERTICALES INFORMATIVOS</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER GRID DE PRODUCTOS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CABECERA PLP</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Componente para mostrar la cabecera de una determinada p&aacute;gina de categor&iacute;a</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Posibilidad de v&iacute;deo (solamente en filtro todos).</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Descripci&oacute;n</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Listado de componentes de iconos</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Listado de componentes enlaces a categor&iacute;as</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se podr&aacute; informar T&iacute;tulo y descripci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">ICONO</span></p><p class="c0"><span class="c1">Detalle: Se podr&aacute; informar una imagen y un texto vinculado a la imagen. Este componente se reutilizar&aacute; en la PLP, PDP, Checkout y Order Success.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Imagen y texto contribuido desde el CMS. Si el mismo icono se va a utilizar en varios lugares del sitio se podr&aacute; utilizar una &uacute;nica instancia.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER GR&Aacute;FICO DE CATEGOR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Dos elementos multimedia (foto o video).</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Multimedia &aacute;rea izquierda</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Multimedia &aacute;rea derecha</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se informar&aacute;n desde el CMS los dos componentes multimedia.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CARD PRODUCTO DE DOS COLUMNAS</span></p><p class="c0"><span class="c1">Detalle: Componente con dos elementos, por un lado, la visualizaci&oacute;n de un producto y por otro elemento multimedia (v&iacute;deo o imagen).</span></p><p class="c0"><span class="c1">La posici&oacute;n (izquierda o derecha) en la que se visualiza el producto o el elemento multimedia puede variar. El producto puede visualizarse varias im&aacute;genes.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Componente &ldquo;card de producto tipo 2&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Multimedia</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Posici&oacute;n producto</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se pintar&aacute; el producto en la posici&oacute;n informada y el elemento multimedia en la otra posici&oacute;n. A trav&eacute;s de la maquetaci&oacute;n modificaremos la forma de visualizar el componente &ldquo;card de producto tipo 2&rdquo; en esta secci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CARD PRODUCTO SIMPLE</span></p><p class="c0"><span class="c1">Detalle: Es un componente igual que el componente &ldquo;CARD PRODUCTO DOS COLUMNAS&rdquo; pero en este caso &uacute;nicamente tiene una &uacute;nica columna con la parte del producto.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Componente &ldquo;card de producto tipo 2&rdquo;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: No se crear&aacute; un componente nuevo, sino que se reutilizar&aacute; &ldquo;CARD PRODUCTO DOS COLUMNAS&rdquo; dejando que la imagen se informe de forma opci&oacute;n, de tal manera que si no se informa estaremos ante este componente.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER ENTREGA Y DELIVERY</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Aunque en el dise&ntilde;o aparecen tres im&aacute;genes fijas con dos textos realizados cada una vamos a permitir crear m&aacute;s elementos si fuera necesario. Este componente se reutiliza en el cart y Checkout.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Listado de componentes &ldquo;entrega&rdquo;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Crearemos un componente entrega que se pueda informar una imagen, un texto principal y un texto secundario. Se podr&aacute;n a&ntilde;adir todos los elementos que se consideren en el Banner.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER RECTANGULAR &ldquo;TIEMPO OBRA MAESTRA&rdquo;</span></p><p class="c0"><span class="c1">Detalle: Componente para a&ntilde;adir textos explicativos.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Un &uacute;nico texto en el que el contribuidor pueda a&ntilde;adir lo que se requiera.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Color de fondo.</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: utilizaremos un editor de texto para que la persona que contribuya el componente pueda decidir el tipo, estilo y tama&ntilde;o de fuente (richtext).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER VERTICAL INFORMATIVO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Componente para a&ntilde;adir textos explicativos en formato vertical con link.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Un &uacute;nico texto en el que el contribuidor pueda a&ntilde;adir lo que se requiera.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Link opcional</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Color de fondo</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Componente similar a &ldquo;BANNER RECTANGULAR&rdquo;, es decir hay que permitir meter un texto enriquecido y adicionalmente en este un enlace.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER GRID DE PRODUCTOS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Componente para mostrar varias fichas de productos</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Listado de componentes &ldquo;&ldquo;card de producto tipo 2&rdquo;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se maquetar&aacute;n en tres columnas (una en m&oacute;vil) y si no hay productos suficientes para llenar una fila se agrupar&aacute;n a la izquierda y se dejar&aacute; en blanco el hueco sobrante. Los productos que muestren la tarjeta ser&aacute;n indicados desde el CMS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; C. PDP</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de esta p&aacute;gina:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; FICHA DE PRODUCTO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE &ldquo;NOTA DE CATA&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER MULTIMEDIA &ndash; TEXTO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER &ldquo;JAM&Oacute;N IB&Eacute;RICO ETIQUETA NEGRA&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER &ldquo;MAESTRO CORTADOR&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER &ldquo;BENEFICIOS PARA LA SALUD&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; VIDEO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPARATIVA 5JS OTROS JAMONES</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; PARTES DEL JAM&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CROSS SELLING REGALOS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">FICHA DE PRODUCTO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: La ficha de producto est&aacute; compuesta por los siguientes elementos:</span></p><p class="c0"><span class="c1">En el lado izquierdo: Carrusel de Im&aacute;genes y v&iacute;deos vinculados a producto (descuentos si aplican).</span></p><p class="c0"><span class="c1">En el lado Derecho:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Intro (Titular, texto corto), descripci&oacute;n, precio, variantes de peso</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Summary (descripci&oacute;n)</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Variantes</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Add to cart (selector de unidades, precio y a&ntilde;adir al carrito)</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Bot&oacute;n volver arriba</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Banner garant&iacute;a y enlaces a delivery.</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: separaci&oacute;n en varios componentes metidos dentro del mismo slot, como funciona OOTB: Imagen (imagen/video), intro (titular y texto corto), summary (descripci&oacute;n), variantes, add to cart (selector de unidades y a&ntilde;adir a la cesta), banner de garant&iacute;a (compartido con banner PLP y checkout), iconos descriptivos (compartido con cabecera plp). Todos los componentes son un tipo de componente espec&iacute;fico que no necesita un desarrollo espec&iacute;fico en backend al no tener informaci&oacute;n contribuida. Desde front toda la informaci&oacute;n se obtiene del producto. La modularizaci&oacute;n permite ocultar los componentes de forma individual si se desea (ocultar el summary si no se desea visualizar por ejemplo).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER &ldquo;NOTA DE CATA&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Componente con una imagen de fondo, un t&iacute;tulo y 4 caracter&iacute;sticas.</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen de fondo</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; N&uacute;mero variable de caracter&iacute;sticas (t&iacute;tulo y descripci&oacute;n)&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Desarrollado de forma modular para permitir a&ntilde;adir t&iacute;tulo global, imagen y un listado de subapartados (con su propio t&iacute;tulo y descripci&oacute;n) de esa forma se puede variar la cantidad de subapartados de forma din&aacute;mica. Se debe realizar una maquetaci&oacute;n adecuada para que la imagen se ajuste a una altura variable dependiendo del n&uacute;mero de caracter&iacute;sticas.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER MULTIMEDIA - TEXTO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: En los dise&ntilde;os se han identificado los ejemplos de &lsquo;Obra Maestra Gastronom&iacute;a&rsquo; y &lsquo;Fascinaci&oacute;n por la naturaleza&rsquo;</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen peque&ntilde;a</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen grande</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Descripci&oacute;n</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Listado de componente &ldquo;destacado&rdquo; (opcional)</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: El campo descripci&oacute;n tiene que ser con un texto enriquecido (ya que tiene negritas). Se debe crear un componente nuevo (Titulo, Subtitulo, texto) para la secci&oacute;n de los 3 componentes debajo del texto.</span></p><p class="c0"><span class="c1">BANNER &ldquo;JAM&Oacute;N IB&Eacute;RICO ETIQUETA NEGRA&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Imagen, titulo y texto</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen para el lado derecho</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Descripci&oacute;n (texto enriquecido)</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Conceptualmente es parecido al banner &ldquo;Multimedia &ndash; texto&rdquo; y por tanto se podr&iacute;an reutilizar buena parte del enfoque.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER &ldquo;MAESTRO CORTADOR&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: T&iacute;tulo (primario y secundario), descripci&oacute;n, animaci&oacute;n en v&iacute;deo y apertura en capa emergente de v&iacute;deo completo</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo primario</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo secundario</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Descripci&oacute;n (texto enriquecido)</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Videos</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: T&iacute;tulo, subtitulo y descripci&oacute;n contribuidos desde CMS, video tambi&eacute;n, pero almacenado en el CDN que se decida. Por restricciones de seguridad del navegador no se permitir&aacute; la reproducci&oacute;n autom&aacute;tica con audio activo (pero si en silencio). En front ser&iacute;an dos componentes: el banner normal y una modal (un dialog, sin componente de back).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER &ldquo;BENEFICIOS PARA LA SALUD&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: T&iacute;tulo y diferentes Cards con dise&ntilde;os diferenciados.</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: divisi&oacute;n en el componente principal (un texto y un array de componentes tipo card), y un componente independiente para cada estilo de card. De esta forma podr&iacute;an a&ntilde;adir nuevos tipos de card en un futuro. Tambi&eacute;n se podr&aacute;n reordenarlas y mostrar varias iguales o aumentar o disminuir la cantidad de cards que se quieran mostrar (no siempre tendr&aacute;n que ser 3) sin necesitar desarrollo adicional. Se ofrecer&aacute;n diferentes plantillas que se podr&aacute;n combinar como se desee, cambiando su orden y la cantidad. Se usar&aacute; la libreria swiper para el carrusel.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">VIDEO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Modal para ver el video en pantalla completa reutilizable de banner &#39;maestro cortador&#39;.</span></p><p class="c0"><span class="c1">Video almacenado en CDN, reproducido sin sonido (se puede dar la opci&oacute;n de activarlo al usuario).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPARATIVA 5JS OTROS JAMONES</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; T&iacute;tulo</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen 5Js</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen otro</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se utilizar&aacute; la librer&iacute;a https://www.npmjs.com/package/dics para obtener los efectos deseados.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE PARTES DEL JAM&Oacute;N (INTERACTIVO)</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Imagen</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Textos</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se pueden plantear dos alternativas: Definir las etiquetas con opciones predefinidas (acordamos la cantidad de etiquetas y su ubicaci&oacute;n de antemano, solo pudiendo editar el texto que se muestra) o dar la libertad de seleccionar las coordenadas en las que se ubicar&aacute;n (es un desarrollo de una complejidad muy superior). Se valora opci&oacute;n primera.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CROSS SELLING REGALOS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Campos a contribuir:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Listado de componentes &ldquo;card de producto tipo 2&rdquo;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Slider de productos utilizando la libreria swiper. Los productos se recuperan de un servicio de productos recomendados de backend.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; D. CESTA Y CARRITO</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de esta p&aacute;gina:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE MINI-CART</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE DETALLE DE COMPRA</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE LATERAL &ldquo;RESUMEN DE PEDIDO&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE LATERAL &ldquo;A&Ntilde;ADIR C&Oacute;DIGO PROMOCIAL&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE LATERAL &ldquo;M&Eacute;TODOS DE PAGO&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE &ldquo;NECESITAS AYUDA&rdquo;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE MINI-CART</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Es una ventana modal (dialog) que se abre desde frontal.</span></p><p class="c0"><span class="c1">Actualmente la versi&oacute;n OOTB ya tiene este componente y los datos visualizados son los que se requieren, por tanto, se debe realizar una adaptaci&oacute;n gr&aacute;fica de estilos, pero el esfuerzo es peque&ntilde;o.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE DETALLE DE COMPRA / CART</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle: Hay varias secciones dentro de la p&aacute;gina que se corresponden con diferentes componentes:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Cards de producto (COMPONENTE DETALLE DE COMPRA). Este componente ya existe en la versi&oacute;n OOTB.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Resumen de pedido (COMPONENTE LATERAL &ldquo;RESUMEN DE PEDIDO&rdquo;). Este componente ya existe en la versi&oacute;n OOTB.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; A&ntilde;adir c&oacute;digo promociona (COMPONENTE LATERAL &ldquo;A&Ntilde;ADIR C&Oacute;DIGO PROMOCIONAL&rdquo;) Este componente ya existe en la versi&oacute;n OOTB.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; M&eacute;todos de pago (COMPONENTE LATERAL &ldquo;M&Eacute;TODOS DE PAGO&rdquo;) Este componente no existe en la versi&oacute;n OOTB pero s&iacute; que existe para en las webs de Osborne&nbsp; y Caviar Riofrio</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Componente &lsquo;Garant&iacute;a&rsquo;. Este componente no existe en la versi&oacute;n OOTB.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Componente &ldquo;Necesita Ayuda&rdquo;. Este componente no existe en la versi&oacute;n OOTB</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Separar el cart en varios componentes permite reordenarlos, activar y desactivar componentes seg&uacute;n preferencias. Los componentes &#39;necesitas ayuda&#39; y &#39;garant&iacute;a&#39; son reutilizables en otras p&aacute;ginas de la web</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; E. CHECKOUT</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de esta p&aacute;gina:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; FORMULARIO DATOS DE ENV&Iacute;O</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; MODO DE ENV&Iacute;O</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; MODOS DE PAGO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; &Aacute;REA RESUMEN DE PEDIDO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE COMPRA REALIZADA</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">FORMULARIO DATOS DE ENV&Iacute;O</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Adem&aacute;s de dar soporte al formulario detallado propondr&iacute;amos la opci&oacute;n de guardar m&uacute;ltiples direcciones y dar al cliente la opci&oacute;n de seleccionar una existente o guardar una nueva. Conllevar&iacute;a algo m&aacute;s de tiempo de desarrollo y una nueva p&aacute;gina para mostrar las direcciones guardadas. OOTB se muestra un grid con las direcciones guardadas y un bot&oacute;n que despliega el formulario para a&ntilde;adir una nueva. Si se decide usar una ya existente se resaltar&aacute; de las dem&aacute;s al seleccionarla</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">MODO DE ENV&Iacute;O</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: M&eacute;todos de env&iacute;o recuperados de Backend.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">MODOS DE PAGO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Modos de pago recuperados de Backend.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&Aacute;REA RESUMEN DE PEDIDO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Lo mismo que la PDP, modular, configurable y flexible y no dependiente de desarrollo de backend. C&oacute;digo reutilizable de carrito, se puede plantear una maquetaci&oacute;n diferente en base a la p&aacute;gina actual en lugar de dos componentes diferentes (ocultar items para la p&aacute;gina de carrito). Componente &#39;necesitas ayuda&#39; reutilizable de carrito, Sugerencia: proponer cambiar el estilo de los productos mostrados por el mismo que el minicart (permitir&iacute;a reutilizar el mismo componente de front).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE COMPRA REALIZADA</span></p><p class="c0"><span class="c1">Constar&aacute; de &Aacute;rea de agradecimiento, &Aacute;rea de detalle de pedido y &Aacute;rea de datos en env&iacute;o y pago.</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Item del pedido reutilizado del listado de productos en el minicart</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; F. EXPERIENCIAS</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de este bloque de p&aacute;ginas:</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE RESERVA DE EXPERIENCIA</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BANNER &lsquo;OTRAS EXPERIENCIAS&rsquo;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER ESENCIA 5JS</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE UBICACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; FICHA RESTAURANTE</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; BOT&Oacute;N RESERVAR STICKY</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE RESERVA DE EXPERIENCIA</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Textos e im&aacute;genes contribuidas desde el CMS. Descripciones como richtext para las negritas. Seleccionar la orientaci&oacute;n del componente (imagen a la derecha o izquierda) con una slider (booleano) en backend. La distribuci&oacute;n se ajustar&aacute; por maquetaci&oacute;n basados en ese campo.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">BANNER &lsquo;OTRAS EXPERIENCIAS&rsquo;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Textos, links e im&aacute;genes contribuidas desde el CMS. Cada experiencia ser&aacute; un componente independiente (como un listado de experiencias dentro del componente principal), por lo que podr&aacute;n cambiar las experiencias que se en la p&aacute;gina sin borrar la contribuci&oacute;n del CMS.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER ESENCIA 5JS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Carrusel creado utilizando la librer&iacute;a swiper, y slides de tipo Banner &#39;jam&oacute;n ib&eacute;rico etiqueta negra&#39;. Fotos,t&iacute;tulo y descripci&oacute;n contribuibles desde CMS.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE UBICACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Textos y coordenadas contribuidos desde el CMS.</span></p><p class="c0"><span class="c1">Contribuyendo cada pareja t&iacute;tulo-texto de forma independiente damos flexibilidad para reordenar los bloques de texto y que no necesiten seguir la misma estructura para cada uno de los establecimientos. Integraci&oacute;n para mostrar el mapa con una librer&iacute;a externa (maps, openMaps, a&uacute;n por concretar).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">FICHA RESTAURANTE</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Contenido contribuido desde el CMS</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; G. PASI&Oacute;N Y MAESTR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de este bloque de p&aacute;ginas:</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE CABECERA PASI&Oacute;N Y MAESTR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CONTENIDO DETALLE PASI&Oacute;N Y MAESTR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE CABECERA PASI&Oacute;N Y MAESTR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; Contenido contribuido desde el CMS. T&iacute;tulos en realidad son un listado de links y cambian de p&aacute;gina, el contenido del banner no cambia al picar en ellos, sino que se redirige a la p&aacute;gina indicada donde (si est&aacute; el mismo banner) el cambio de p&aacute;gina resultara &#39;inapreciable&#39;.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CONTENIDO DETALLE PASI&Oacute;N Y MAESTR&Iacute;A</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n:&nbsp; P&aacute;gina de contenido personalizable, dado lo heterog&eacute;neo de su material no se modelan componentes y se adapta su dise&ntilde;o a la propuesta concreta. Si se ve oportuno podr&iacute;an analizarse cada una de las p&aacute;ginas de pasi&oacute;n y maestr&iacute;a y dividirla en componentes m&aacute;s generalizables con un formato m&aacute;s estandarizado y homog&eacute;neo.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; H. COMPROMISO</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de este bloque de p&aacute;ginas:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE MULTIMEDIA DE CABECERA</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CARD COMPROMISO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE MULTIMEDIA DE CABECERA</span></p><p class="c0"><span class="c1">Consta de Elemento multimedia de fondo (v&iacute;deo o imagen), T&iacute;tulos de p&aacute;rrafo enlazables, incluye efecto gr&aacute;fico de despliegue de opci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Contenido contribuido por CMS. Para los p&aacute;rrafos enlazables se propone usar frames (la parte de la url que lleva una #). Asociando un id a cada uno de los cards de compromiso que debe de coincidir con el t&iacute;tulo de este componente podemos hacer scroll al parrafo, pero ambos componentes deben ser contribuidos y tener cuidado de usar valores &uacute;nicos para cada card de compromiso. Otra opci&oacute;n ser&iacute;a utilizar el uuid (generado por back) del componente de cada card de compromiso para forzar a que sea &uacute;nico, pero no es descriptivo y puede resultar lioso a la hora de vincularlo al p&aacute;rrafo.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">CARD COMPROMISO</span></p><p class="c0"><span class="c1">El citado componente constar&aacute; de</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Color background</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Color fuente</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Descripci&oacute;n</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Titulo principal y secundario</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Orientaci&oacute;n (define d&oacute;nde y c&oacute;mo se ubica el &aacute;rea textual, as&iacute; como la ubicaci&oacute;n deseada de las fotos - arriba, dcha. abajo-).</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Fotos (m&aacute;ximo 4 por elemento).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Contenidos contribuibles globalmente por CMS.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; I. STORIES</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de este bloque de p&aacute;ginas:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; SLIDER CARD STORIES</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">SLIDER CARD STORIES</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Slider que se alimenta de elementos de tipo Card Story (detallados en componentes comunes).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; J. AYUDA</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de este bloque de p&aacute;ginas</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; GRID DE RECOMENDACIONES</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; POST CON CONTENIDO SOBRE RECOMENDACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; COMPONENTE CONTACTO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">GRID DE RECOMENDACIONES</span></p><p class="c0"><span class="c1">Contenedor de cards de recomendaciones, constar&iacute;a de Foto thumbnail, T&iacute;tulo primario, Categorizaci&oacute;n</span></p><p class="c0"><span class="c1">Descripci&oacute;n corta, Fecha, Enlace a detalle de recomendaci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se propone creaci&oacute;n de slot para las recomendaciones con restricciones para que no se puedan a&ntilde;adir componentes que no sean de tipo recomendaci&oacute;n. Usando un template espec&iacute;fico para esta p&aacute;gina podemos maquetar todos los componentes que se a&ntilde;adan como un grid.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">POST CON CONTENIDO SOBRE RECOMENDACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Se propone la creaci&oacute;n de m&uacute;ltiples componentes para permitir variar la cantidad de elementos y estandarizar la experiencia.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">COMPONENTE CONTACTO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Desarrollo ad hoc.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; K. PRECIOS Y DISPONIBILIDAD</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">GESTI&Oacute;N GR&Aacute;FICA DE ESTADOS DE DISPONIBILIDAD Y PRECIO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Detalle de la soluci&oacute;n: Implementaci&oacute;n en cada una de las tarjetas de producto (y por lo tanto en los banners), incorporaci&oacute;n de contenido relativo al stock de producto, as&iacute; como precios y/o promociones.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; L. MI CUENTA</span></p><p class="c0"><span class="c1">Se identifican los siguientes componentes espec&iacute;ficos de este bloque de p&aacute;ginas</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; LOGIN Y REGISTRO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; LISTADO DE PEDIDOS</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; DETALLE DE PEDIDO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; CANCELACI&Oacute;N DE PEDIDO</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; PERFIL Y DIRECCI&Oacute;N DE FACTURACI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; LISTADO DE DIRECCIONES</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; AGREGAR NUEVA DIRECCI&Oacute;N</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; NAVEGACI&Oacute;N ENTRE P&Aacute;GINAS DE USUARIO</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Todas estas p&aacute;ginas tender&aacute;n a reutilizarse al m&aacute;ximo teniendo como foco la web actual de Osborne y el OOTB de SAP Commerce</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; 4. Gesti&oacute;n de cat&aacute;logos</span></p><p class="c0"><span class="c1">El cat&aacute;logo de productos de Osborne ejercer&aacute; de maestro de cat&aacute;logos en las webs de 5J, para el caso espa&ntilde;ol la traslaci&oacute;n ser&aacute; directa, para el caso del rollout global se usar&aacute; ese cat&aacute;logo como base, pero teniendo en cuenta que habr&aacute; que hacer ciertas restricciones.</span></p><p class="c0"><span class="c1">Finalmente, y de cara al rollout en USA el cat&aacute;logo ser&aacute; espec&iacute;fico (los SKUs tambi&eacute;n ser&aacute;n diferentes)</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.4.3. Integraciones m&eacute;todos de pagos: Apple Pay</span></p><p class="c0"><span class="c1">Se agregar&aacute; la plataforma de pago Apple Pay al conjunto de modos de pago con los que se trabaja en el grupo Osborne.</span></p><p class="c0"><span class="c1">La citada integraci&oacute;n se realizar&aacute; a trav&eacute;s de Redsys, TPV virtual ya incorporado al proyecto actual de Osborne y que se reutilizar&aacute; para el de cinco jotas.</span></p><p class="c0"><span class="c1">Apple Pay permite que los clientes hagan pagos usando cualquier tarjeta de cr&eacute;dito o d&eacute;bito en su dispositivo Apple.</span></p><p class="c0"><span class="c1">Al integrar y hacer uso de Apple Pay, se aceptan las condiciones de uso de Apple.</span></p><p class="c0"><span class="c1">Se realizar&iacute;a mediante el m&eacute;todo de conexi&oacute;n por redirecci&oacute;n: Aceptaci&oacute;n de Apple Pay en la web</span></p><p class="c0"><span class="c1">Se pueden empezar a aceptar pagos con Apple Pay de forma autom&aacute;tica en el TPV Virtual solicitando la activaci&oacute;n del m&eacute;todo de pago a la entidad bancaria. No se requieren desarrollos t&eacute;cnicos.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">El m&eacute;todo de pago ser&aacute; seleccionable en el interfaz del TPV Virtual:</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Al pulsar sobre &eacute;l, se proceder&aacute; a la elecci&oacute;n de la tarjeta y autenticaci&oacute;n de Apple Pay</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Una vez seleccionado, el pago ser&aacute; procesado autom&aacute;ticamente.</span></p><p class="c0"><span class="c1">Si se quiere forzar la ejecuci&oacute;n del m&eacute;todo de pago Apple Pay (en lugar de mostrar la p&aacute;gina de introducci&oacute;n de datos de tarjeta), se debe enviar en el campo DS_MERCHANT_PAYMETHODS el valor &lsquo;xpay&rsquo; (sin comillas).</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.4.4. Integraci&oacute;n con feeds de Amazon Shopping</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Amazon Shopping es una plataforma de comercio electr&oacute;nico operada por Amazon que permite a los vendedores y marcas listar y vender sus productos a los clientes. Los vendedores pueden cargar feeds de productos para actualizar y administrar su inventario en la plataforma de Amazon Shopping.</span></p><p class="c0"><span class="c1">Los feeds de Amazon contienen informaci&oacute;n detallada de los productos que se venden, incluyendo detalles como el nombre del producto, la descripci&oacute;n, el precio, la cantidad, la categor&iacute;a, la imagen del producto y otros atributos relevantes. Estos feeds se pueden subir en varios formatos como archivos de texto delimitados (.txt) o archivos XML.</span></p><p class="c0"><span class="c1">Para integrarlo en la plataforma de SAP Commerce habr&aacute; que seguir los siguientes pasos:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; 1. Preparar el feed del producto: exportar la informaci&oacute;n de tu producto desde el sistema SAP en un formato que sea compatible con los requisitos de Amazon. La idea es reutilizar al m&aacute;ximo posible otras integraciones an&aacute;logas ya realizadas como podr&iacute;a ser la de Google Shopping.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; 2. Convertir a Formato de Amazon: Habr&aacute; que formatear estos datos de acuerdo con las especificaciones de Amazon. Esto puede implicar reestructurar los campos para que coincidan con el formato requerido por Amazon, a&ntilde;adir o eliminar ciertos datos y asegurarse de que todas las descripciones e im&aacute;genes del producto est&eacute;n en su lugar.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; 3. Cargar el Feed: Se requiere cargar este feed a la cuenta de vendedor de Amazon a trav&eacute;s del Centro de Vendedores. Amazon tiene una funcionalidad que permite hacer una carga masiva de productos utilizando el feed suministrado.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; 4. Actualizaciones Regulares: El cronjob de exportaci&oacute;n del feed debe relanzarse siempre que haya un cambio relevante en el juego de productos de 5J, para poder trasladar variaciones en el inventario.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.4.5. Otras Integraciones</span></p><p class="c0"><span class="c1">Es habitual que uno de los puntos m&aacute;s costosos de un proyecto de ecommerce son las distintas integraciones con los sistemas como ERP, Marketing, PIM de productos, etc para traer al ecommerce datos como productos, precios, stock, promociones, estados del pedido y para informar a otros sistemas de los pedidos realizados, devoluciones, etc.</span></p><p class="c0"><span class="c1">En el caso de este proyecto el esfuerzo destinado a integraciones va a ser muy peque&ntilde;o ya que las webs de Osborne y Caviar Riofrio ya est&aacute;n desarrolladas bajo tecnolog&iacute;a SAP Commerce. Con 5Js a&ntilde;adiremos un nuevo site a la soluci&oacute;n, pero las principales integraciones ya est&aacute;n desarrolladas. Adem&aacute;s, en la web de Osborne existe la posibilidad de adquirir productos de 5Js en la actualidad, por tanto, ya existe una integraci&oacute;n que nos trae al ecommerce datos de productos de 5Js, precios, etc. Habr&aacute; que realizar peque&ntilde;as modificaciones en las integraciones para modificar el site por ejemplo, o alguna particularidad concreta para 5Js, pero el grueso de las integraciones ya est&aacute; desarrollado y operativo.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1.1</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1.2</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1.3</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1.4</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.5. Requisitos no funcionales</span></p><p class="c0"><span class="c1">Hacemos foco en este apartado fundamentalmente al modo de cumplimiento de los requerimientos SEO trasladados por el grupo Osborne.</span></p><p class="c0"><span class="c1">Nuestra prioridad es optimizar la web para garantizar una experiencia de usuario fluida y r&aacute;pida, sin comprometer la calidad de los recursos y la experiencia gr&aacute;fica dise&ntilde;ada originalmente.</span></p><p class="c0"><span class="c1">A continuaci&oacute;n, se desglosar&aacute;n las estrategias clave para optimizar en ese sentido el comportamiento de la web</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.5.1. Requisitos implementaci&oacute;n SEO</span></p><p class="c0"><span class="c1">Optimizaci&oacute;n de Elementos Visuales:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se estudiar&aacute; la disposici&oacute;n de los elementos visuales del sitio web, asegurando que cada bloque est&eacute; estrat&eacute;gicamente ubicado y dimensionado para evitar problemas de desplazamiento o redimensionamiento.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se trabajar&aacute; en la optimizaci&oacute;n de im&aacute;genes para reducir los tiempos de carga. Esto incluir&aacute; el uso de im&aacute;genes con dimensiones adecuadas y formatos eficientes como WebP, JPEG o SVG.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se verificar&aacute; que el tama&ntilde;o de los activos sea apropiado para el tama&ntilde;o de la pantalla del usuario. Por ejemplo, no se desear&aacute; mostrar im&aacute;genes de tama&ntilde;o de escritorio en una ventana gr&aacute;fica que requiera im&aacute;genes de tama&ntilde;o m&oacute;vil.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se implementar&aacute; la t&eacute;cnica de carga diferida para las im&aacute;genes (&quot;lazy loading&quot;), lo que significa que las im&aacute;genes se cargar&aacute;n solo cuando sean visibles en la pantalla del usuario, mejorando significativamente la velocidad de carga.</span></p><p class="c0"><span class="c1">Mejora de Recursos CSS y JS:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se definir&aacute; una &quot;ruta cr&iacute;tica de renderizado&quot; que incluir&aacute; elementos CSS y JS esenciales en el encabezado de la p&aacute;gina para acelerar el proceso de renderizado.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Cuando sea necesario incorporar scripts o c&oacute;digo de terceros en el c&oacute;digo de la p&aacute;gina, se buscar&aacute; reducir su impacto en el rendimiento. Para hacer esto, emplearemos el atributo async o defer para evitar que estos scripts bloqueen la carga de la p&aacute;gina. Adem&aacute;s, colocaremos estos scripts justo antes de la etiqueta de cierre &lt;/body&gt; para asegurar que se carguen despu&eacute;s de que el contenido de la p&aacute;gina se haya cargado.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se minimizar&aacute; el c&oacute;digo CSS y JS para reducir el tama&ntilde;o de los archivos y mejorar la velocidad de carga del sitio.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se dividir&aacute; el c&oacute;digo JavaScript en varios fragmentos (una t&eacute;cnica conocida como Lazy Loading) para cargar solo los fragmentos de JavaScript que se necesitan para cada p&aacute;gina. Composable Storefront ha implementado lazy loading para varias de sus propias bibliotecas, pero tambi&eacute;n se puede mejorar a&uacute;n m&aacute;s el rendimiento de la tienda mediante el uso de t&eacute;cnicas de carga perezosa en los m&oacute;dulos personalizados.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Solo se cargar&aacute; el CSS y JavaScript que se necesita en cada p&aacute;gina.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se utilizar&aacute;n fuentes y CSS en l&iacute;nea en lugar de cargarlos de forma as&iacute;ncrona.</span></p><p class="c0"><span class="c1">Mejoras en el Servidor:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se implementar&aacute;n cach&eacute;s eficientes para im&aacute;genes, archivos CSS y JS, lo que permitir&aacute; cargar estos elementos de manera m&aacute;s r&aacute;pida.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se mantendr&aacute; una cach&eacute; de segundo nivel (L2) para todos los activos del sitio, as&iacute; como para las solicitudes HTTP que se pueden almacenar en cach&eacute;, como las llamadas a OCC para usuarios an&oacute;nimos que no cambian con frecuencia.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se utilizar&aacute; la compresi&oacute;n de recursos est&aacute;ticos para reducir el tiempo de transmisi&oacute;n y mejorar el rendimiento general.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se configurar&aacute; una pol&iacute;tica de cach&eacute; del navegador apropiada para todos los activos de la p&aacute;gina. La cach&eacute; del navegador ahorra mucho ancho de banda y mejora el tiempo de carga de la p&aacute;gina (tanto inicial como posterior) cuando se configura y ajusta correctamente.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se aprovechar&aacute; el mecanismo de estado de transferencia SSR para evitar llamadas XHR duplicadas.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Composable Storefront es una Aplicaci&oacute;n Web Progresiva (PWA). Como resultado, se puede configurar su service worker para almacenar en cach&eacute; recursos que no cambian con frecuencia (como recursos, activos y solicitudes HXR), lo que acelerar&aacute; las cargas de p&aacute;ginas posteriores. Tambi&eacute;n se puede habilitar que su aplicaci&oacute;n de tienda funcione sin conexi&oacute;n.</span></p><p class="c0"><span class="c1">Otras acciones a acometer:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se minimizar&aacute; la cantidad de solicitudes HTTP s&iacute;ncronas y as&iacute;ncronas tanto como sea posible.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Se utilizar&aacute; la compresi&oacute;n HTTP siempre que sea posible para mejorar la velocidad de transferencia y optimizar el ancho de banda.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Al realizar llamadas a APIs, como OCC, se intentar&aacute; solicitar solo los datos que se necesitan. Las respuestas de OCC con fields=FULL contienen mucha informaci&oacute;n que podr&iacute;a no necesitarse. Cuanto m&aacute;s grande sea la respuesta, m&aacute;s tiempo llevar&aacute; recuperarla y procesarla. La misma pr&aacute;ctica se aplica a las APIs que admiten paginaci&oacute;n.</span></p><p class="c0"><span class="c1">Utilizaci&oacute;n de t&eacute;cnica Above-the-Fold Loading</span></p><p class="c0"><span class="c1">T&eacute;cnica que prioriza la creaci&oacute;n de componentes que se encuentran Above-the-Fold (&#39;por encima del doblez&#39;). El t&eacute;rmino &#39;por encima del doblez&#39; tradicionalmente se refiere a la mitad superior de un peri&oacute;dico, donde se encuentran las historias m&aacute;s importantes.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Cuando este concepto se traslada a la web, se refiere a todos los componentes que se colocan en la parte superior de la p&aacute;gina, donde comienza la experiencia.</span></p><p class="c0"><span class="c1">El plegado de la p&aacute;gina es configurable para cada plantilla de p&aacute;gina y punto de interrupci&oacute;n. La configuraci&oacute;n de plegado de p&aacute;gina es solo una indicaci&oacute;n para acelerar la creaci&oacute;n inicial de page slots que se encuentran en la mitad superior de la p&aacute;gina. Todos los page slots se renderizan si se encuentran en la mitad superior de la p&aacute;gina. El plegado de p&aacute;gina se configura asignando un espacio de p&aacute;gina al par&aacute;metro pageFold. Este espacio de p&aacute;gina, y todos los espacios de p&aacute;gina hermanos anteriores, est&aacute;n &quot;en la mitad superior de la p&aacute;gina&quot;. Estos espacios de p&aacute;gina tienen prioridad por delante de los espacios de p&aacute;gina que est&aacute;n &quot;en la mitad inferior de la p&aacute;gina&quot;.</span></p><p class="c0"><span class="c1">El plegado de p&aacute;gina es parte de la configuraci&oacute;n de LayoutConfig. El pliegue de p&aacute;gina indica el &uacute;ltimo espacio de p&aacute;gina que debe mostrarse en la parte superior del pliegue.</span></p><p class="c0"><span class="c1">El siguiente ejemplo incluye un ejemplo de configuraci&oacute;n de plegado de p&aacute;gina para la plantilla de p&aacute;gina LandingPageTemplate en SAP Commerce y Composable Storefront.</span></p><p class="c0"><span class="c1">LandingPageTemplate: {</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; pageFold: &#39;Section2B&#39;,</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; slots: [</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#39;Section1&#39;,</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#39;Section2A&#39;,</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#39;Section2B&#39;,</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; [...]</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; ]</span></p><p class="c0"><span class="c1">}</span></p><p class="c0"><span class="c1">De forma predeterminada, cuando se cargan page slots en la p&aacute;gina, no hay una altura m&iacute;nima disponible para los espacios de p&aacute;gina o los componentes. La altura real solo se agrega cuando se cargan los componentes y las reglas CSS asociadas se aplican a los componentes. Las ranuras para p&aacute;ginas ajustan su altura autom&aacute;ticamente cuando se cargan los componentes. Por lo tanto, los espacios de p&aacute;gina no tienen una altura inicial, raz&oacute;n por la cual inicialmente terminan en el viewport. Esto evita que funcione la t&eacute;cnica de carga diferida, porque depende de que el contenido no est&eacute; en el viewport.</span></p><p class="c0"><span class="c1">Dado que el contenido se puede agregar en tiempo de ejecuci&oacute;n, no es posible implementar una altura m&iacute;nima (codificada) para espacios de p&aacute;gina o componentes; todo depende de lo que se agregar&aacute; en tiempo de ejecuci&oacute;n. Si bien esta falta de altura m&iacute;nima podr&iacute;a compensarse con las llamadas reglas CSS de &quot;dise&ntilde;o fantasma&quot;, siempre habr&aacute; una brecha entre el dise&ntilde;o fantasma y el contenido real.</span></p><p class="c0"><span class="c1">Para que sea posible aplazar la carga de contenido en la mitad inferior de la p&aacute;gina, composable storefront marca los page slots que se encuentran debajo del pliegue de la p&aacute;gina mientras se cargan los page slots de la parte superior del pliegue. Todos los page slots est&aacute;n marcados con una clase cx-pending siempre que no est&eacute;n cargados todos los componentes internos. Adem&aacute;s, el slot de plegado de p&aacute;gina tiene una clase page-fold. Con estas dos clases, composable storefront puede aplicar varias reglas CSS para controlar la carga diferida de contenido en la mitad inferior de la p&aacute;gina.</span></p><p class="c0"><span class="c1">Gesti&oacute;n de animaciones</span></p><p class="c0"><span class="c1">La web de 5J va a contar con una serie de animaciones que potenciar&aacute;n notablemente la experiencia visual del usuario y enriquecer&aacute;n la interacci&oacute;n del usuario con el contenido.</span></p><p class="c0"><span class="c1">En este contexto proponemos el uso de Animaciones CSS a trav&eacute;s del Scroll, una t&eacute;cnica que se destaca por su eficiencia y simplicidad, sin la necesidad de recurrir a JavaScript</span></p><p class="c0"><span class="c1">Esta elecci&oacute;n se basa en la premisa de aprovechar al m&aacute;ximo las capacidades nativas del navegador web, lo que garantiza una carga r&aacute;pida y un rendimiento fluido en todas las plataformas. La implementaci&oacute;n de Animaciones CSS vinculadas al scroll es una soluci&oacute;n altamente efectiva para lograr una experiencia de usuario de alta calidad.</span></p><p class="c0"><span class="c1">Para comprender mejor este enfoque, en el siguiente recurso puede verse un v&iacute;deo que proporciona una visi&oacute;n detallada de c&oacute;mo implementar Animaciones CSS en relaci&oacute;n con el scroll ( https://www.youtube.com/watch?v=AbCYziNyjvk) A trav&eacute;s de este m&eacute;todo, el proceso se simplifica considerablemente: se vincula una animaci&oacute;n est&aacute;ndar con el scroll, se define el nivel de &#39;delay&#39; (es decir, el porcentaje de scroll que debe completarse antes de que comience la animaci&oacute;n), y se logra una animaci&oacute;n fluida tanto en la entrada como en la salida, o ambas.</span></p><p class="c0"><span class="c1">Es importante destacar que esta estrategia no se limita a una simple implementaci&oacute;n de animaciones CSS. Tambi&eacute;n abogamos por la optimizaci&oacute;n de este proceso mediante la creaci&oacute;n de clases reutilizables para cada tipo de animaci&oacute;n. Este enfoque simplifica a&uacute;n m&aacute;s la programaci&oacute;n, acelera el desarrollo y, lo que es m&aacute;s importante, garantiza una eficiencia m&aacute;xima.</span></p><p class="c0"><span class="c1">Esta propuesta busca aprovechar al m&aacute;ximo las capacidades nativas de los navegadores web para proporcionar a la web de 5J un comportamiento gr&aacute;fico avanzado en t&eacute;rminos de animaciones. Esto no solo mejorar&aacute; la est&eacute;tica de la p&aacute;gina, sino que tambi&eacute;n contribuir&aacute; significativamente a ua experiencia de usuario satisfactoria.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Alojamiento de v&iacute;deo</span></p><p class="c0"><span class="c1">Se propone el uso de Vimeo como plataforma de alojamiento de videos. Vimeo se ha transformado de una plataforma orientada al consumidor a una soluci&oacute;n profesional de alto nivel. Esta evoluci&oacute;n la convierte en una opci&oacute;n recomendable para alojar los videos de la nueva web de 5J por varias razones:</span></p><p class="c0"><span class="c1">Calidad Profesional: Vimeo se ha centrado en ofrecer servicios de alojamiento de videos de alta calidad para profesionales. Esto garantiza que los videos se vean y funcionen de manera &oacute;ptima, lo que es esencial para una experiencia de usuario excepcional en la web de 5J.</span></p><p class="c0"><span class="c1">API y Flexibilidad: Vimeo ofrece una API de video que permite una integraci&oacute;n sencilla y personalizada con la web de 5J. Esto es esencial para garantizar una experiencia de usuario perfecta y para el desarrollo futuro de la plataforma.</span></p><p class="c0"><span class="c1">Vimeo utiliza una red global de distribuci&oacute;n de contenido (CDN) para almacenar y entregar videos desde servidores ubicados estrat&eacute;gicamente en todo el mundo. Esto significa que, sin importar d&oacute;nde se encuentre un visitante de la web de 5J, los videos se cargar&aacute;n desde el servidor CDN m&aacute;s cercano, reduciendo significativamente los tiempos de carga.</span></p><p class="c0"><span class="c1">Optimizaci&oacute;n de Videos: Vimeo comprime y optimiza los videos para que sean compatibles con una amplia variedad de dispositivos y velocidades de conexi&oacute;n a internet. Esto asegura que los videos se carguen r&aacute;pidamente incluso en conexiones m&aacute;s lentas, sin sacrificar la calidad.</span></p><p class="c0"><span class="c1">Streaming Adaptativo: Vimeo utiliza t&eacute;cnicas de streaming adaptativo que ajustan autom&aacute;ticamente la calidad del video seg&uacute;n la velocidad de conexi&oacute;n del usuario. Esto evita que los videos se congelen o se reproduzcan con baja calidad, lo que garantiza una experiencia fluida.</span></p><p class="c0"><span class="c1">Tecnolog&iacute;a HTML5: Vimeo utiliza reproductores de video basados en HTML5, que son altamente eficientes y no requieren complementos adicionales. Esto garantiza que los videos se reproduzcan de manera r&aacute;pida y sin problemas en una variedad de dispositivos y navegadores.</span></p><p class="c0"><span class="c1">Servicio Confiable: Vimeo es conocido por su confiabilidad y tiempo de actividad constante. Esto asegura que los videos est&eacute;n disponibles para los visitantes de la web de 5J en todo momento, sin demoras imprevistas.</span></p><p class="c0"><span class="c1">Compatibilidad: Vimeo es compatible con una amplia variedad de formatos de video, lo que facilita la administraci&oacute;n de contenido multimedia diverso.</span></p><p class="c0"><span class="c1">Experiencia Comprobada: Vimeo ha estado en el mercado desde 2004 y es considerada una de las principales plataformas de alojamiento de videos en l&iacute;nea. Su experiencia y reputaci&oacute;n la convierten en una opci&oacute;n confiable.</span></p><p class="c0"><span class="c1">Herramientas de An&aacute;lisis: Vimeo proporciona una amplia gama de herramientas de an&aacute;lisis para medir el rendimiento de tu contenido. Esto te permite comprender c&oacute;mo interact&uacute;an los usuarios con tus videos y optimizar tus estrategias.</span></p><p class="c0"><span class="c1">Seguridad y Protecci&oacute;n: Vimeo ofrece diversas caracter&iacute;sticas de seguridad, como la protecci&oacute;n con contrase&ntilde;a, lo que garantiza que tus videos est&eacute;n protegidos y solo sean accesibles para las personas adecuadas.&nbsp;</span></p><p class="c0"><span class="c1">Vimeo ofrece una soluci&oacute;n completa y profesional para alojar y gestionar videos en la web de 5J. Su enfoque en la calidad, seguridad y personalizaci&oacute;n la hacen recomendable para garantizar una experiencia de usuario excepcional.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Aunque Grupo Osborne cuente con una actual agencia que marcar&aacute; la recomendaci&oacute;n y gu&iacute;a de posicionamiento SEO, Hiberus en todo momento pondr&aacute; a disposici&oacute;n del proyecto al equipo SEO necesario para asegurar el &eacute;xito de la migraci&oacute;n. Este equipo es especialista en SEO y esta focalizado en la implementaci&oacute;n de estrategias y migraciones sobre la tecnolog&iacute;a de SAP Commerce.&nbsp;</span></p><p class="c0"><span class="c1">Es importante recalcar la importancia que tiene dentro del proyecto de 5Js y el resto de site&acute;s, la realizaci&oacute;n de una buena migraci&oacute;n SEO por su alta dependencia en posicionamiento de marca.</span></p><p class="c0"><span class="c1">Adem&aacute;s de eso, en Hiberus contamos con especialistas en cualquier otro &aacute;mbito dentro del proyecto como anal&iacute;tica, UX, UI, tal y como se detalle en el punto 6.1. Expertos en Estrategia Digital.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.6. Migraci&oacute;n de Datos</span></p><p class="c0"><span class="c1">A continuaci&oacute;n, detallamos el plan de migraci&oacute;n de datos para el desarrollo del nuevo site. Para ello, hemos tenido en cuenta la situaci&oacute;n actual de contar con un ecommerce en funcionamiento y las necesidades trasladadas por Osborne en cuanto a la migraci&oacute;n: migraci&oacute;n de datos de clientes e informaci&oacute;n de las p&aacute;ginas (Blog y paginas generales). El objetivo de este proceso es lograr una migraci&oacute;n exitosa y sin problemas, garantizando la integridad y la precisi&oacute;n de los datos transferidos.</span></p><p class="c0"><span class="c1">Por nuestra experiencia en otros proyectos similares, la migraci&oacute;n de todos los datos es una tarea compleja y ha de orientarse como un trabajo conjunto de refinamiento y construcci&oacute;n que realizar&aacute; Hiberus y deber&aacute; apoyarse en el equipo de Osborne involucrado en el proyecto.</span></p><p class="c0"><span class="c1">Alcance del Proyecto</span></p><p class="c0"><span class="c1">El proyecto de migraci&oacute;n de contenido cubrir&aacute; los siguientes elementos:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Datos de clientes: La informaci&oacute;n de clientes ser&aacute; migrada.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Contenido CMS: bloques y p&aacute;ginas con contenido est&aacute;tico.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Blog: art&iacute;culos, categor&iacute;as, autores, etc. (ver si lo a&ntilde;adimos fuera)</span></p><p class="c0"><span class="c1">No estar&aacute; contemplado:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Pedidos: detalles de pedidos, pagos, env&iacute;os y devoluciones.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Datos de productos: No ser&aacute; necesario migrar los datos de productos ya que viajaran desde el ERP.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Accesos y logins: Las credenciales de inicio de sesi&oacute;n de los clientes existentes no ser&aacute; necesario migrarlo, ya que se implementar&aacute;n nuevas medidas de seguridad que requerir&aacute;n del cambio de contrase&ntilde;a por parte de los usuarios.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Otros datos: Cualquier otra informaci&oacute;n contenida en el ecommerce actual. En este punto, es importante recalcar que en la fase de an&aacute;lisis inicial de proyecto se podr&aacute; acotar con el equipo de Osborne si existe alg&uacute;n requerimiento en este sentido que no est&eacute; incluido en la propuesta y desde el equipo de Hiberus podamos a&ntilde;adir al proyecto.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Planificaci&oacute;n y Cronograma</span></p><p class="c0"><span class="c1">La fase inicial de planificaci&oacute;n es clave para conseguir el &eacute;xito de la migraci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Realizar un an&aacute;lisis inicial de los datos existentes en la plataforma actual.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Definir los objetivos y requisitos espec&iacute;ficos de la migraci&oacute;n, por cada uno de los bloques de datos.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Bajar a detalle un cronograma que incluya actividades de extracci&oacute;n, limpieza, transformaci&oacute;n, mapeo, importaci&oacute;n y validaci&oacute;n de datos.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Revisi&oacute;n de los recursos asignados, incluyendo desarrolladores, expertos en datos, etc.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Proceso de Migraci&oacute;n</span></p><p class="c0"><span class="c1">El proceso de migraci&oacute;n seguir&aacute; las siguientes fases:</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Extracci&oacute;n de Datos</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Desarrollar scripts o utilizar herramientas de migraci&oacute;n para extraer los datos de clientes, productos, historiales, etc, en la plataforma actual.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Validar la integridad y precisi&oacute;n de los datos extra&iacute;dos.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Limpieza y Transformaci&oacute;n de Datos</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Revisi&oacute;n de los datos duplicados o irrelevantes para su eliminaci&oacute;n (en el caso de que existan).</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Normalizar los formatos de datos y corregir errores o inconsistencias.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Asegurarse de que los datos cumplan con las estructuras y requisitos de la nueva plataforma bajo SAP Commerce.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Mapeo de Datos</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Identificar los campos de datos correspondientes en la plataforma actual y la nueva plataforma.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Establecer relaciones y estructuras adecuadas para la transferencia de datos.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Documentar el mapeo de campos para referencia futura.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Importaci&oacute;n de Datos</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Utilizar herramientas de importaci&oacute;n o desarrollar scripts personalizados para cargar los datos en el nuevo sistema.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Realizar pruebas y test que garanticen la precisi&oacute;n y la integridad de los datos importados.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp; &bull; Verificaci&oacute;n y Validaci&oacute;n</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Comparar los datos importados con los datos originales para verificar la precisi&oacute;n y la integridad.</span></p><p class="c0"><span class="c1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#9702; Realizar pruebas funcionales para garantizar el existo de la migraci&oacute;n.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Esquema de la migraci&oacute;n</span></p><p class="c0"><span class="c1">A continuaci&oacute;n, detallamos el esquema de la soluci&oacute;n planteada en el punto anterior.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Plan de contingencia.</span></p><p class="c0"><span class="c1">Objetivo: dado que la migraci&oacute;n es un proceso cr&iacute;tico, se deber&aacute; realizar un an&aacute;lisis de los riesgos y problem&aacute;ticas que puedan surgir durante el desarrollo de la misma. Se generar&aacute; documentaci&oacute;n de los problemas espec&iacute;ficos detectados y se buscar&aacute; soluci&oacute;n a los problemas, incluso fuera del &aacute;mbito del proyecto con el equipo especialista en Data de Hiberus, si fuera necesario. Por &uacute;ltimo, realizaremos pruebas adicionales una vez est&eacute; resuelto.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Confidencialidad de los datos</span></p><p class="c0"><span class="c1">Como detallamos en otros apartados, estamos comprometidos con la privacidad y la seguridad en los datos, por ello, se mantendr&aacute; una estricta confidencialidad de los datos objeto de la migraci&oacute;n. Como se indica en el apartado de cumplimiento, tanto desde Hiberus como las propias plataformas cuentan con las m&aacute;ximas medidas de seguridad sobre el uso y tratamiento de los datos.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">Hiberus cuenta con un &aacute;rea especializada en Magento/Adobe Commerce que llegado el momento podr&iacute;a ayudar al equipo de SAP con cualquier impedimento que pueda surgir en la plataforma actual. Adem&aacute;s de eso, contamos con amplia experiencia en las migraciones de estas herramientas a SAP Commerce.&nbsp; Su &eacute;xito se basa en un equipo de expertos y la implementaci&oacute;n de mejores pr&aacute;cticas, garantizando transiciones sin problemas y mejoras en la experiencia del cliente.</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c1">&nbsp;</span></p><p class="c0"><span class="c4"><a class="c5" href="https://www.google.com/url?q=https://wordtohtml.net&amp;sa=D&amp;source=editors&amp;ust=1697378503496045&amp;usg=AOvVaw2UM_1I7lLj--SOeVGaulbd">Convertido a HTML con WordToHTML.net</a></span></p></body></html>